"""Задания по стилю кода и именованию переменных."""

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None

variable_comparasion = id(spam) == id(eggs)

# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым
active_students = []

# назови переменную, которая хранит текущее количество студентов в потоке
current_students_count = None

# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45
mininum_number = 1
maximum_number = 45

# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
PI = 3.1415926535
